// Any.Run Corrupt File Zero Day Attack

// https://www.linkedin.com/posts/0x534c_httpsxcomanyrunappstatus1861024272463909018-activity-7269357711639633920-4xZK/

// ð—–ð˜‚ð˜€ð˜ð—¼ð—º ð— ð——ð—¢ ð—žð—¤ð—Ÿ ð——ð—²ð˜ð—²ð—°ð˜ð—¶ð—¼ð—» ð—³ð—¼ð—¿ ð—½ð—¼ð˜ð—²ð—»ð˜ð—¶ð—®ð—¹ ð—­ð—˜ð—¥ð—¢-ð——ð—”ð—¬ ð—”ð˜ð˜ð—®ð—°ð—¸:

EmailAttachmentInfo
| where Timestamp> ago(1h)
| where FileName endswith ".docx"
| where FileType == "zip" or FileType == "unknown;"
| join EmailEvents on NetworkMessageId
| where EmailDirection == "Inbound"
| where DeliveryAction == "Delivered"
