// Critical Identities Privilege Escalation on Entra Service Principal
// https://www.linkedin.com/posts/0x534c_defenderxdr-customdetection-exposuremanagement-activity-7182618135659692032-HsE5/

//Custom DefenderXDR privilege escalation detection rule for critical identities marked by exposure management for adding Entra service principal credentials. It is vital for SecOps to monitor organization's critical identities for any potential privilege escalation in Entra service principals.

let CriticalIdentities =
ExposureGraphNodes
| where set_has_element(Categories, "identity")
| where isnotnull(NodeProperties.rawData.criticalityLevel) 
and NodeProperties.rawData.criticalityLevel.criticalityLevel < 4
| extend AccountID = tostring(NodeProperties.rawData.accountObjectId)
| distinct AccountID;
CloudAppEvents
| where ActivityType == "Add"
| where ActionType == @"Add service principal credentials."
| where AccountId has_any(CriticalIdentities)


// MITRE ATT&CK Mapping

// The KQL query can be mapped to the following MITRE ATT&CK techniques:

// T1078.004 - Valid Accounts: Cloud Accounts:
// The query is looking for the addition of service principal credentials, which can be associated with the use of valid cloud accounts to gain unauthorized access.

// T1098 - Account Manipulation:
// Adding service principal credentials can be seen as a form of account manipulation, where adversaries modify accounts to maintain access.

// T1078 - Valid Accounts:
// The use of valid accounts, especially those with elevated privileges, is a common technique for maintaining persistence and accessing resources.
