//Identity Blast Radius KQL
//https://www.linkedin.com/feed/update/urn:li:activity:7174327431485431808/

//Assessing high risk identity account blast radius by using risk data from AADSignInEventsBeta and edge/nodes data from ExposureGraphEdges and ExposureGraphNodes to determine the list of assets that can be potentially impacted in the event of account compromised.

let HighRiskAccounts =
AADSignInEventsBeta
| where RiskLevelAggregated > 50
| distinct AccountDisplayName;
ExposureGraphEdges 
| where EdgeLabel == @"can authenticate to"
| where SourceNodeName has_any (HighRiskAccounts)
| join ExposureGraphNodes on $left.TargetNodeId==$right.NodeId
| summarize by SourceNodeName, TargetNodeName

// MITRE ATT&CK Mapping

// Based on the analysis, the KQL query can be associated with the following MITRE ATT&CK techniques:

// T1078 - Valid Accounts:
// The query identifies accounts that have a high risk level and can authenticate to other nodes, which aligns with the use of valid accounts for lateral movement or persistence1.
// T1071 - Application Layer Protocol:
// The query involves analyzing authentication events, which can be related to the use of application layer protocols for command and control2.
// T1087 - Account Discovery:
// The query discovers high-risk accounts and their authentication capabilities, which is related to account discovery techniques3.
