// MS Teams DLP Playbook
// https://www.linkedin.com/posts/activity-7196076361977847808-JGST/

// The document (Teams DLP Playbook 2024.pdf) in the blog provides an overview of how enterprise customers can deploy Microsoft Teams-DLP for protecting sensitive information.

// Using Defender Custom Detection, the below KQL allow you to detect real-time DLP rules triggered:

CloudAppEvents
| where Application == "Microsoft Teams"
| where ActionType contains "DlpRuleMatch"

// The detection of DLP rule matches in Microsoft Teams can be associated with the following MITRE ATT&CK techniques:

// T1070.004 - Indicator Removal on Host: File Deletion: DLP rules often trigger when sensitive data is being moved or deleted to prevent data exfiltration1.
// T1567 - Exfiltration Over Web Service: If the DLP rule is triggered by an attempt to exfiltrate data via Teams, this technique is relevant2.
// T1071.001 - Application Layer Protocol: Web Protocols: Microsoft Teams uses web protocols for communication, and DLP rules can help detect suspicious activities over these protocols3.
