//Threat hunting voice phishing for Teams
//https://www.linkedin.com/feed/update/urn:li:activity:7168258404447186945/

//Threat hunting voice phishing 👄🐟 (or "vishing") with Copilot 🤖 for Microsoft 365 (Mitre Technique T1598.004)

//Download your Teams PSTN usage report and open your report with Copilot Excel. Enter the prompt:
//Which "caller number" appear the most time with different unique "Display Name" where the "Call Direction" is inbound and "Success" is No ?

//As shown below (right side), Copilot identified the vishing number "XXXXXXX2650" with distinct count of 23 times. Most of these calls will be ended up in voicemail and transcript as email voice email back to the user.

//To validate Copilot identified the correct vishing number "XXXXXXX2650", in DefenderXDR Advanced Hunting run the below KQL:
EmailEvents
| where SenderMailFromAddress contains "noreply_skype_voicemail"
| where SenderFromAddress !contains "@"
| where SenderFromAddress contains "XXXXXXX2650"
| project SenderFromAddress, Subject


// MITRE ATT&CK Mapping

// Based on the filtering criteria, this query is likely aimed at detecting phishing or suspicious email activities. Here are the relevant MITRE ATT&CK techniques:

// Phishing (T1566):
// T1566.001: Spearphishing Attachment - The query looks for specific patterns in email addresses that could indicate phishing attempts.
// T1566.002: Spearphishing Link - The absence of “@” in the sender’s address and the presence of specific patterns might indicate attempts to deceive recipients.
// Command and Control (T1071):
// T1071.003: Application Layer Protocol - The use of email as a communication channel for malicious activities.
// Credential Access (T1110):
// T1110.001: Password Guessing - The query might help identify attempts to use compromised email accounts.
