// Tracking The Most Dangerous Entra Admin Role 
// https://www.linkedin.com/posts/activity-7189502682628349952-Uc9z/

// Custom DefenderXDR KQL detecting this dangerous role activation: 

let DangerousAdmin =
ExposureGraphNodes
| where set_has_element(Categories, "identity")
| extend AccountUPN = NodeProperties.rawData.accountUpn
| extend AdminRoles = NodeProperties.rawData.assignedRoles
| where AdminRoles contains "Partner Tier2 Support"
| project AccountUPN;
IdentityLogonEvents
| where AccountUpn has_any(DangerousAdmin)

// MITRE ATT&CK Mapping

// T1078.004: Valid Accounts: Cloud Accounts - Identifying and monitoring privileged accounts in cloud environments.
// T1078: Valid Accounts - Monitoring logon events for suspicious activity.
// T1078.001: Valid Accounts: Domain Accounts - Tracking logon events for domain accounts.
