//Defending malicious MS graph activity with MS Sentinel Threat Intelligence
//https://www.linkedin.com/pulse/defending-malicious-ms-graph-activity-sentinel-threat-steven-lim-yorjc/

//This article assumed you have already configured your Microsoft Graph Activity Logs through Diagnostic Setting in the Entra Portal and you have the Microsoft data connector for Microsoft Sentinel (Threat Intelligence - TAXII) enabled and fully configured to receive a good cyber threat intelligence feed.

MicrosoftGraphActivityLogs
| where TimeGenerated > ago(1h)
| distinct IPAddress
| join ThreatIntelligenceIndicator on $left.IPAddress == $right.NetworkIP

// Add New Query for new Table ThreatIntelIndicators as the previous one is deprecated and will shut down soon. Ref : https://learn.microsoft.com/en-us/azure/sentinel/work-with-stix-objects-indicators

MicrosoftGraphActivityLogs
| where TimeGenerated > ago(1h)
| distinct IPAddress
| join kind = inner (ThreatIntelIndicators
| where IndicatorType in ("ipv4-addr", "ipv6-addr", "network-traffic"))on $left.IPAddress == $right.ObservableValue

//Microsoft have released a new premium user risk detection in Identity Protection called Suspicious API Traffic. This detection is reported when Identity Protection detects anomalous Graph traffic by a user. Suspicious API traffic might suggest that a user is compromised and conducting reconnaissance in their environment. 

SigninLogs
| where RiskEventTypes contains "suspiciousAPITraffic"

// MITRE ATT&CK Mapping

// Based on the operations and objectives of the KQL code, the following MITRE ATT&CK techniques are relevant:

// T1071.001 - Application Layer Protocol: Web Protocols: The use of Microsoft Graph API can be associated with web protocols.
// T1071.003 - Application Layer Protocol: Mail Protocols: If the Graph API is used for email-related activities.
// T1595.002 - Active Scanning: Vulnerability Scanning: If the IP addresses are involved in scanning activities.
// T1078 - Valid Accounts: Suspicious API traffic might indicate the use of compromised accounts.
// T1587.001 - Develop Capabilities: Malware: If the suspicious traffic is related to malware activities.
// T1589.002 - Gather Victim Network Information: DNS: If the suspicious traffic involves DNS queries.

