//Detecting TeamsPhisher attack with Azure Sentinel
//https://www.linkedin.com/pulse/detecting-teamsphisher-attack-azure-sentinel-steven-lim/

OfficeActivity
| where TimeGenerated > ago(1h)
| where RecordType =~ 'MicrosoftTeams'
| where Operation == "MessageCreatedHasLink"
| where CommunicationType == "OneOnOne" or CommunicationType == "GroupChat"
| where UserId !endswith "your_corporate_domain_1"     // Filter off all internal teams user 1-to-1 message
and UserId !endswith "your_corporate_domain_2"
and UserId !endswith "your_corporate_domain_3"
| extend UserDomains = tostring(split(UserId, '@')[1])
| extend UserIPs = tostring(split(ClientIP, '::ffff:')[1])
| where UserIPs != ""
| distinct UserIPs
| join ThreatIntelligenceIndicator on $left.UserIPs == $right.NetworkIP

// Upgrade Detection to new Table ThreatIntelIndicators. Ref : https://learn.microsoft.com/en-us/azure/sentinel/work-with-stix-objects-indicators 

OfficeActivity
| where TimeGenerated > ago(1h)
| where RecordType =~ 'MicrosoftTeams'
| where Operation == "MessageCreatedHasLink"
| where CommunicationType == "OneOnOne" or CommunicationType == "GroupChat"
| where UserId !endswith "your_corporate_domain_1"     // Filter off all internal teams user 1-to-1 message
and UserId !endswith "your_corporate_domain_2"
and UserId !endswith "your_corporate_domain_3"
| extend UserDomains = tostring(split(UserId, '@')[1])
| extend UserIPs = tostring(split(ClientIP, '::ffff:')[1])
| where UserIPs != ""
| distinct UserIPs
| join kind = inner ThreatIntelIndicators
| where IndicatorType in ("ipv4-addr", "ipv6-addr", "network-traffic") )on $left.UserIPs == $right.ObservableValue

// MITRE ATT&CK Mapping

// Based on the operations and objectives of the KQL code, the following MITRE ATT&CK techniques are relevant:

// T1071.001 - Application Layer Protocol: Web Protocols:
// The query looks for messages with links, which can be used for command and control via web protocols.
// T1071.003 - Application Layer Protocol: Mail Protocols:
// Although this is specific to email, the concept of using communication platforms for malicious purposes is similar.
// T1071.004 - Application Layer Protocol: Remote Services:
// External communication via Microsoft Teams can be considered a form of remote service.
// T1071.005 - Application Layer Protocol: Web Protocols:
// Detecting links in messages aligns with identifying potential web-based command and control.
// T1071.006 - Application Layer Protocol: Web Protocols:
// The use of external IP addresses and domains can indicate external command and control.
// T1071.007 - Application Layer Protocol: Web Protocols:
// Correlating with threat intelligence indicators helps identify known malicious infrastructure.
