// Detect Privilege Admin under AiTM attack
// https://www.linkedin.com/posts/0x534c_sentinel-privilegeadmin-aitm-activity-7227603649688952832--1Id/
//Sentinel rule trigger => Run Playbook "Disable User Account"
//A simple and effective offline detection and mitigation strategy.

let PrivilegeAdmin =
IdentityInfo
| where AssignedRoles != "[]" and isnotnull(AssignedRoles)
| distinct AccountUPN;
AADUserRiskEvents
| where RiskEventType == "attackerinTheMiddle"
| where UserPrincipalName has_any(PrivilegeAdmin)

// #Sentinel #PrivilegeAdmin #AiTM #IdentityProtection #Entra #PremiumDetection
