// ð—”ð—°ð˜ð—¶ð˜ƒð—¶ð˜ð˜† ð—£ð—¿ð—¼ð—³ð—¶ð—¹ð—²: ð—”ð—¾ð˜‚ð—® ð—•ð—¹ð—¶ð˜‡ð˜‡ð—®ð—¿ð—± ð—¶ð—ºð—½ð—¹ð—²ð—ºð—²ð—»ð˜ð—¶ð—»ð—´ ð—–ð—¹ð—¼ð˜‚ð—±ð—³ð—¹ð—®ð—¿ð—² ð—§ð˜‚ð—»ð—»ð—²ð—¹ ð˜€ð—²ð—¿ð˜ƒð—¶ð—°ð—² ð˜ð—¼ ð—°ð—¼ð—»ð—°ð—²ð—®ð—¹ ð—–2
// https://security.microsoft.com/threatanalytics3/48213822-f322-424f-9f0d-c619cefad8c9/analystreport

// âºï¸T1572 Protocol Tunneling | Aqua Blizzard uses Cloudflare Tunnel to tunnel network communications to and from a target system within a separate protocol to avoid detection or network filtering
// âºï¸T1102 Web Service | Aqua Blizzard uses Cloudflare services for C2 communications
// âºï¸T1090 Proxy | Aqua Blizzard uses Cloudflare Tunnel to obfuscate the host IP address of HTTP GET requests for malicious scripts/payloads

// ð—žð—¤ð—Ÿ ð˜ð—¼ ð—°ð—µð—²ð—°ð—¸ ð—³ð—¼ð—¿ ð—”ð—¾ð˜‚ð—® ð—•ð—¹ð—¶ð˜‡ð˜‡ð—®ð—¿ð—± ð—®ð—°ð˜ð—¶ð˜ƒð—¶ð˜ð—¶ð—²ð˜€:

let AquaBlizzardIPs = dynamic(["167.71.193.19","146.190.129.82","137.184.50.238","146.190.173.21","143.244.162.106","128.199.170.197","147.182.245.94","167.99.73.109","139.59.227.7","159.65.226.187","137.184.86.236","137.184.142.176","146.190.33.206","68.183.185.84","68.183.226.96","157.230.83.122","67.205.171.195","139.59.236.13","147.182.235.190","146.190.129.82"]);
DeviceNetworkEvents
| where TimeGenerated > ago(90d) 
| where ActionType == @"HttpConnectionInspected"
| extend ConnectInfo = todynamic(AdditionalFields)
| extend HttpHost = ConnectInfo.host
| where RemoteIP has_any(AquaBlizzardIPs)
| project TimeGenerated, DeviceId, DeviceName, LocalIP, RemoteIP, HttpHost, AdditionalFields, ConnectInfo
