// Insider Threat - Monitor sensitive bulk download data email to external 
// https://www.linkedin.com/posts/activity-7193119880718520320-RO72/

// This scheduled hourly Sentinel analytic rule is particular useful in detecting O365/Azure/Entra admins performing bulk download of users/groups/devices information from portal and sending that piece of information out to external via email.

let BulkDataFileNames =
AuditLogs
| where TimeGenerated > ago(90d)
| where OperationName == "Download group members - finished (bulk)" or  OperationName == "Download devices - finished (bulk)" or  OperationName == "Download service principals - finished (bulk)" or  OperationName == "started (bulk)"
| where ResultDescription contains "Filename"
| extend AccountUPN = tostring(InitiatedBy.user.userPrincipalName)
| parse ResultDescription with * "Filename:" Filename ". Activity" Blank
| project Filename;
EmailAttachmentInfo
| where TimeGenerated > ago(1h)
| where FileName has_any(BulkDataFileNames)
| where RecipientEmailAddress !contains "contoso.com" // Corporate Domain


// MITRE ATT&CK Mapping

// Based on the operations and data involved, the following MITRE ATT&CK techniques are relevant:

// Data from Information Repositories (T1213):
// The query identifies bulk downloads of group members, devices, and service principals, which aligns with adversaries accessing data from information repositories1.
// Exfiltration Over Web Service (T1567):
// The query checks for email attachments sent outside the corporate domain, indicating potential data exfiltration via email2.
// Automated Collection (T1119):
// The use of automated scripts to download bulk data suggests automated collection techniques3.
