// KQL for detecting potential hashtag#RegreSSHion abuse
// https://www.linkedin.com/posts/activity-7214588446722465792-FwFr/

// ** Assumption **
// Firewall logs stream to CommonSecurityLog 
// 6 OpenSSH connections per min for minimum 6 hours
// 6x60x6 = 2160 connections for past 6 hours
// Attack source is non-distributed, triangulate by country level
// Feel free to adjust the assumption parameters to your environment needs

CommonSecurityLog
| where TimeGenerated >= ago (6h)
| where DestinationPort == "22"
| extend ip_location=geo_info_from_ip_address(SourceIP)
| extend Country=tostring(ip_location.country)
| where Country != ""
| summarize SSH_Connection=count() by Country 
| sort by SSH_Connection desc
| where SSH_Connection > 2160

// If analytics rule get triggered, this probably warrant a deeper investigation

// MITRE ATT&CK Mapping

// This query can be associated with the following MITRE ATT&CK techniques:

// T1078 - Valid Accounts:
// Detecting SSH connections can help identify the use of valid accounts for unauthorized access.
// T1021 - Remote Services:
// SSH is a remote service, and monitoring connections can help detect unauthorized remote access.
// T1036 - Masquerading:
// High volumes of SSH connections from unexpected countries might indicate attempts to masquerade as legitimate users.
// T1040 - Network Sniffing:
// Although not directly related, monitoring SSH connections can help identify potential network sniffing activities if attackers are trying to capture credentials.
