// https://www.linkedin.com/posts/0x534c_cybersecurity-t1555-credentialtheft-activity-7324667429035368448-t6om

ThreatIntelIndicators
| where TimeGenerated > ago(365d)
| where now() between (ValidFrom .. ValidUntil)
| where isnotempty(Data.labels)
| mv-expand Data.labels
| where Data_labels has "mitre"
| extend MitreID = parse_json(tostring(Data_labels)).Alias 
| where MitreID == "T1555.003" // Credentials from Web Browsers
| summarize IOCcount=count() by ObservableKey, Confidence
| sort by IOCcount desc 
