//Threat Hunting Nation State Actors
//https://www.linkedin.com/feed/update/urn:li:activity:7173156446581219328/

//In view of recent security updates from Microsoft on the January breach by Midnight Blizzard, for those on Microsoft Entra ID P2 you can also use Signin log's riskEventsTypes_v2 to threat hunt for possible nation state actors involvement on your Entra tenant by using below KQL query.

SigninLogs
| where TimeGenerated > ago(90d)
| extend V2Risk = tostring(RiskEventTypes_V2)
| where V2Risk contains "estsRiskStateP"


// MITRE ATT&CK Mapping

// The query focuses on filtering sign-in logs based on risk events, which can be associated with the following MITRE ATT&CK techniques:

// T1078 - Valid Accounts: Monitoring sign-in logs helps detect the use of valid accounts by adversaries1.
// T1110 - Brute Force: Risk events related to sign-ins can indicate brute force attempts1.
// T1190 - Exploit Public-Facing Application: Sign-in attempts might be part of exploiting public-facing applications1.
// T1071 - Application Layer Protocol: Sign-in logs can reveal the use of application layer protocols for command and control1.
