// ð—§ð—µð—² ð—›ð˜‚ð—»ð˜ ð—³ð—¼ð—¿ ð—•ð—¹ð—¼ð—¯ ð—£ð—µð—¶ð˜€ð—µð—¶ð—»ð—´ ð— ð—®ð—¶ð—¹ ð——ð—¼ð—ºð—®ð—¶ð—»

// In some phishing kit, the attacker generated the landing page in a blob to remain stealthy and all of these emails usually passes the SPF/DKIM/DMNARC/CompAuth. However the blob URL has a URL detonation reputation. Using the below KQL to reverse find all the malicious mail domains that are sending blob phishing URLs and block these mail domains at the Tenant Block List.

EmailUrlInfo
| where TimeGenerated > ago(90d)
| where Url contains "web.core.windows.net/"
| join EmailEvents on NetworkMessageId
| where EmailDirection == "Inbound"
| where DeliveryAction == "Blocked"
| summarize Count=count() by SenderFromDomain
| sort by Count desc 

